[
    {
        "judul": "Membangun Aplikasi E-Commerce UniStore Berbasis<br>Web Service Menggunakan Golang dan MongoDB",
        "judulbab1": "BAB I ",
        "judulbab2": "BAB II ",
        "judulbab3": "BAB III ",
        "judulbab4": "BAB IV ",
        "judulbab5": "BAB V ",
        "judulbab6": "BAB VI ",
        "judulbab7": "BAB VII ",
        "judulbab8": "BAB VIII ",
        "judulbab9": "BAB IX ",
        "judulbab10": "BAB X ",
        "latar_belakang": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Di zaman ini, banyak orang merasa lebih nyaman melakukan berbagai aktivitas secara daring, termasuk bermain video game, berinteraksi dengan sesama, bekerja, belajar, dan berbelanja secara online [1]. Terbukti bahwa dalam 10 tahun terakhir, semakin banyak masyarakat yang melakukan jual beli online [2]. Hal ini terjadi karena internet telah berkembang dengan pesat dan memberikan peluang bagi pelaku bisnis untuk menjangkau lebih banyak pelanggan [3]. Oleh karena itu, kami merasa bahwa memulai bisnis e-commerce adalah langkah yang tepat di era sekarang. Dengan berbagai alasan yang telah kami jelaskan di atas, kami percaya bahwa aplikasi e-commerce yang kami kembangkan akan menjadi hal yang umum, bahkan di kalangan pelaku Usaha Mikro, Kecil, dan Menengah (UMKM) di masa depan. Pada studi literatur yang dibuat sebelumnya menunjukan bahwa penggunaan aplikasi e-commerce menjadi lebih efisien bagi para pelaku wirausaha, berdasarkan analisis data statik menunjukan bahwa aplikasi e-commerce dapat mempermudah serta meningkatkan kepercayaan pihak konsumen, dan masih sangat sedikit pelaku UMKM yang menggunakan aplikasi e-commerce meskipun telah terbukti banyak manfaatnya [4]–[6]. Buku kami ini bertujuan agar pembaca dapat memahami dan mengimplementasikan membuat aplikasi e-commerce yang mudah digunakan oleh para pengusaha kecil, sehingga mereka dapat meraih kesuksesan lebih baik.<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dalam rangka mengembangkan aplikasi layanan web dengan tema e-commerce, ada beberapa masalah yang harus diselesaikan, masalah pertama yaitu membangun basis data  yang lintas platform, selanjutnya membangun package backend yang dapat diakses secara publik, kemudian membuat API yang dapat menghubungkan backend dengan frontend, dan terakhir mengintegrasikan frontend dengan API yang telah dibuat. Berdasarkan hasil kajian yang telah kami lakukan, kami memutuskan untuk menggunakan bahasa pemrograman Golang dalam upaya membangun backend yang optimal untuk proyek ini. Meskipun Golang mengintegrasikan prinsip-prinsip bahasa pemrograman lain, namun perlu ditekankan bahwa Golang menonjol dengan kinerja yang terbilang efisien [7]–[9]. Dalam mengembangkan aplikasi berbasis web, kami merasa penting untuk menyediakan antarmuka yang mampu menampilkan aplikasi dalam format HTML. Untuk tujuan ini, kami memilih untuk menggunakan bahasa pemrograman JavaScript. Perlu dicatat bahwa JavaScript memiliki keunggulan signifikan dalam konteks pengembangan aplikasi web dan situs, sebab bahasa ini berjalan di sisi klien, mampu menciptakan interaktivitas yang responsif, mendukung pemrosesan asinkron, serta memanfaatkan ekosistem yang sangat beragam dan fleksibe [10]–[12].<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dalam konteks pengambilan dan penyimpanan data, kami telah memilih sistem basis data MongoDB. MongoDB adalah sebuah sistem basis data berorientasi dokumen yang bersifat lintas platform dan dikategorikan sebagai sistem basis data NoSQL [13]–[15]. Untuk mengintegrasikan MongoDB dengan frontend, kami memanfaatkan layanan yang disediakan oleh Google Cloud Platform (GCP). Google Cloud Platform adalah suatu rangkaian layanan komputasi, penyimpanan data, dan pengembangan aplikasi di ranah komputasi awan yang awalnya dikembangkan oleh Google [16]–[18].",
        "tujuan_intruksional": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dalam buku ini, terdapat lima tujuan utama yang menjadi fokus utama pengembangan aplikasi e-commerce kami. Pertama, yaitu proses pembangunan sistem backend aplikasi e-commerce. Selanjutnya, pembangunan sistem basis data NoSQL, yang akan digunakan untuk menyimpan data aplikasi e-commerce kami. Kemudian, pengintegrasian sistem basis data dengan cloud service yang disediakan oleh Google Cloud Platform (GCP). Selanjutnya, proses pembangunan antarmuka aplikasi yang menggunakan format HTML. Terakhir, langkah-langkah menghubungkan. Dengan kelima tujuan ini, buku ini bertujuan memberikan pemahaman yang komprehensif serta pengeimplementasian tentang pengembangan aplikasi e-commerce dari awal hingga akhir, memungkinkan pembaca untuk meraih keberhasilan dalam pengembangan proyek serupa.",
        "capaian_pembelajaran": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dalam buku ini, pembaca akan memperoleh beragam capaian pembelajaran yang mencakup aspek-aspek kunci dalam pengembangan aplikasi e-commerce. Berikut adalah daftar capaian pembelajaran yang akan dijelaskan secara mendalam:<br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1. Menguasai Bahasa Pemrograman Golang : Pembaca akan memahami penggunaan bahasa pemrograman Golang dalam membangun sistem backend aplikasi e-commerce. Buku ini akan menguraikan prinsip-prinsip dan teknik dasar yang diperlukan untuk mengembangkan backend yang efisien.<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2. Integrasi Antarmuka dengan JavaScript : Pembaca akan belajar cara menghubungkan antarmuka aplikasi dengan sistem backend menggunakan bahasa pemrograman JavaScript. Buku ini akan menjelaskan bagaimana JavaScript berperan dalam menciptakan pengalaman pengguna yang interaktif dan responsif.<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3. Penggunaan Framework Tailwind CSS : Pembaca akan diajarkan bagaimana menggunakan framework Tailwind CSS dalam pembangunan antarmuka berformat HTML. Buku ini akan menggali fitur-fitur Tailwind CSS yang memungkinkan pengembangan antarmuka yang modern dan mudah disesuaikan.<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4. Pemahaman Sistem Basis Data NoSQL (MongoDB) : Pembaca akan mendapatkan pengetahuan mendalam tentang penggunaan sistem basis data NoSQL, khususnya MongoDB, dalam konteks aplikasi e-commerce. Buku ini akan menjelaskan bagaimana mendesain dan mengelola basis data NoSQL untuk kebutuhan aplikasi.<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5. Integrasi dengan Google Cloud Platform (GCP): Pembaca akan memahami bagaimana menghubungkan sistem basis data MongoDB dengan layanan awan Google Cloud Platform. Buku ini akan menjelaskan konsep dan praktik terbaik dalam mengelola data aplikasi di lingkungan awan.",
        "lingkup_dokumentasi": "1. Bahasa pemrograman yang digunakan dalam membangun sistem backend adalah Golang.<br>2.Bahasa pemrograman yang digunakan untuk menghubungkan interface dengan adalah JavaScript.<br>3.Framework yang digunakan dalam membangun interface berformat HTML adalah Tailwind CSS.<br>4.Sistem basis data berformat nosql yang digunakan adalah MongoDB.<br>5.Cloud service yang digunakan untuk menghubungkan MongoDB dengan interface adalah Google Cloud Platform"
    }
]