[
    {
        "judul": "Laporan",
        "latar_belakang": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Di era sekarang ini orang-orang lebih nyaman melakukan sesuatu secara online mulai dari bermain video game secara online, berinteraksi secara online, bekerja secara online, belajar secara online, bahkan berbelanja pun juga secara online. Hal ini disebabkan oleh kemajuan internet yang sangat pesat dan memberikan kesempatan bagi para pelaku bisnis untuk memperluas jangkauan target pasar. Karena itu lah kami merasa memulai e-commerce adalah langkah yang tepat di era sekarang ini.<br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Masyarakat yang mempraktekkan jual beli online meningkat setiap tahun nya dalam 10 tahun terakhir ini [1]. Oleh karena itu kami memprediksi di tahun yang akan datang aplikasi e-commerce ini akan menjadi hal yang lumrah bahkan di kalangan UMKM. Project kami ini bertujuan untuk membangun aplikasi e-commerce yang dapat digunakan dengan mudah oleh pengusaha-pengusaha kecil.<br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dalam pengambilan dan penyimpanan data kami menggunakan sistem database yaitu MongoDB, MongoDB adalah sistem basis data berorientasi dokumen lintas platform yang diklasifikasikan sebagai basis data nosql. MongoDB mengindari struktur basis data relasional tabel berbasis tradisional yang mendukung json seperti dokumen dengan skema dinamis.<br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Berdasarkan penelitian yang kami lakukan, dalam membangun sistem backend yang efisien dalam proyek kali ini menggunakan bahasa pemrograman golang. Meskipun golang menggabungkan konsep dari bahasa pemrograman lain, namun golang memiliki performa yang relatif cepat.<br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Untuk membangun aplikasi berbasis website diperlukan interface yang dapat menampilkan aplikasi dengan format HTML, dan disini kami menggunakan bahasa javascript. JavaScript adalah bahasa pemrograman yang memiliki kelebihan utama dalam pengembangan web dan aplikasi, karena ia berjalan di sisi klien, memungkinkan interaktivitas yang responsif, pemrosesan asinkron, dan ekosistem yang kaya dan serbaguna.<br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dalam menghubungkan MongoDB dengan frontend kami menggunakan servis dari GCP (Googke Cloud Platform). Google Cloud Platform adalah sebuah rangkaian layanan cloud public yang sejatinya diciptakan Google sebagai layanan keperluan komputasi, storage, dan app development yang berjalan di hardware Google.",
        "indentifikasi_masalah": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Berdasarkan latar belakang di atas dapat di identifikasi masalah pada proyek kali ini ialah sebagai berikut :<br><br>1.Bagaimana membangun sistem backend aplikasi e-commerce?<br>2.Bagaimana membangun sistem basis data nosql?<br>3.Bagaimana menghubungkan sistem basis data dengan cloud service?<br>4.Bagaimana membangun interface aplikasi berformat HTML?<br>5.Bagaimana menghubungkan sistem backend yang telah dibuat dengan interface?",
        "tujuan": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Berdasarkan masalah yang telah di indetifikasi pada proyek kali ini dapat di uraikan tujuan dari proyek kali ini ialah sebagai berikut :<br><br>1.Membangun sistem backend aplikasi e-commerce.<br>2.Membangun sistem basis data nosql.<br>3.Menghubungkan sistem basis data dengan cloud service.<br>4.Membangun interface aplikasi berformat HTML.<br>5.Menghubungkan sistem backend yang telah dibuat dengan interface",
        "lingkup_dokumentasi": "1. Bahasa pemrograman yang digunakan dalam membangun sistem backend adalah Golang.<br>2.Bahasa pemrograman yang digunakan untuk menghubungkan interface dengan adalah JavaScript.<br>3.Framework yang digunakan dalam membangun interface berformat HTML adalah Tailwind CSS.<br>4.Sistem basis data berformat nosql yang digunakan adalah MongoDB.<br>5.Cloud service yang digunakan untuk menghubungkan MongoDB dengan interface adalah Google Cloud Platform"
    }
]